fun main() {
    val time: Int = 12 * 60 * 60 // in sec
    print("был(а) ${agoToText(time)}")
}

fun agoToText(time: Int): String {
    if (time < 0) {
        return ""
    }
    return when (time) {
        in 0..60 -> "только что"
        in 61..60 * 60 -> {
            when (time / 60 % 10) {
                0, 5, 6, 7, 8, 9 -> "${time / 60} минут назад"
                1 -> "${time / 60} минуту назад"
                2, 3, 4 -> "${time / 60} минуты назад"
                else -> ""
            }
        }
        in (60 * 60 + 1)..(24 * 60 * 60) -> {
            when (time / 60 / 60 % 100) {
                11, 12, 13, 14 -> "${time / 60 / 60} часов назад"
                else -> when (time / 60 / 60 % 10) {
                    0, 5, 6, 7, 8, 9 -> "${time / 60 / 60} часов назад"
                    1 -> "${time / 60 / 60} час назад"
                    2, 3, 4 -> "${time / 60 / 60} часа назад"
                    else -> ""
                }
            }
        }
        in (24 * 60 * 60 + 1)..(2 * 24 * 60 * 60) -> "сегодня"
        in (2 * 24 * 60 * 60 + 1)..(3 * 24 * 60 * 60) -> "вчера"
        else -> "давно"
    }
}